{"title":"Encore un blog de geek ?!","headings":[],"date":"2011-03-27T00:00:00.000Z","lang":"fr","tags":["blog"],"body":{"tag":"div","children":[{"tag":"p","children":["Bienvenue (ou pas) sur ma tentative de blog. Moi c’est Maxime, aka MoOx sur le\nnet."]},"\n",{"tag":"p","children":["Depuis le temps que j’en parlais à ",{"tag":"a","props":{"href":"http://cheezburger.com/3246458112"},"children":["un de mes lolcat"]},". Depuis le temps que je\nsoulais ma chérie avec ça (après lui avoir ouvert son ",{"tag":"a","props":{"href":"http://dame.bio/"},"children":["blog de recettes\nbio"]},"). Voilà j’ouvre mon blog. Un vrai. Un avec WordPress quoi. La grande\nclasse."]},"\n",{"tag":"p","children":["Mais qu’es ce que ça va donner ? Un blog de geek. Encore un me direz-vous ? Bah\nouais. Avec du code en plus ? Et ouais."]},"\n",{"tag":"p","children":["Du coup, vu que je sais pas trop comment me lancer, voilà ce que je me propose\nde faire dans une premier temps: je vais expliquer comment j’ai pu monter ce\nblog. Ça qui fera office de mémos pour moi. Je passerais surement par quelques\nétapes du style : installer et configurer son serveur web (apache, php, mysql,\nvhosts toussa), installer et surtout bien configurer wordpress, créer un thème\nHTML5 proprement (et facilement), mettre du ARIA dedans, ensuite faire des\nzolies feuilles de styles CSS 3, mettre un peu de Javascript (jQuery) pour\najouter de la vie au documents…"]},"\n",{"tag":"p","children":["Y’aura aussi de quoi optimiser un site au petit oignons. Ça c’est mon petit\nkiff."]},"\n",{"tag":"p","children":["Là je pense que j’ai déjà quelques billets. De quoi faire vu que je suis pas\npressé et que je fais ça pour le fun."]},"\n",{"tag":"p","children":["Puis quand ça sera fait, bah, je partagerais des choses que j’ai envie qui\npourront être du style plugins jQuery, composants CSS ce genre de truc (vu que\nje suis développeur frontend… ou plutôt ",{"tag":"a","props":{"href":"http://css.4design.tl/metiers-du-web-je-suis-enveloppeur-web-moi-monsieur"},"children":["enveloppeur web"]},"). J’parlerais peut\nêtre aussi de tricks liés aux OS (basé sur Unix très certainement), avec des\nlignes de commandes ce genre de trucs. J’parlerais aussi PHP avec Zend Framework\nou même Symfony si chui un ouf. Puis si vraiment je suis en forme, j’utiliserais\nmême Git sur GitHub pour partager du code wahoo ( ",{"tag":"a","props":{"href":"https://github.com/MoOx","title":"Accéder à mon profil Github"},"children":["ça en fait c’est déjà\nfait"]},") !"]},"\n",{"tag":"p","children":["Puis pour changer un peu, j’essayerais de faire ça avec un peu d’humour et de\nconneries."]},"\n",{"tag":"p","children":["Enfin bon on vera."]},"\n",{"tag":"p","children":[{"tag":"em","children":["Vous noterez que mon site n’est pas fini et loin d’être optimisé, dans un sens\nc’est un peu volontaire  et donc ça fera l’objet de posts ^^ !"]}]}]}}