{"title":"A static website with React? Really?","headings":[{"level":2,"text":"Transcript","id":"transcript"}],"date":"2016-12-04T00:00:00.000Z","conference":"dotJS 2016","slides":"https://speakerdeck.com/moox/a-static-website-with-react-really-at-dotjs-2016","slidesEmbed":"https://speakerdeck.com/player/b9faea2ddaf64e23a36ce9fede6732cd?title=false","video":"https://www.youtube.com/watch?v=WpPc8MyYC5k","videoEmbed":"https://www.youtube.com/embed/WpPc8MyYC5k","body":{"tag":"div","children":[{"tag":"h2","props":{"id":"transcript"},"children":[{"tag":"a","props":{"aria-hidden":"true","href":"#transcript"},"children":[{"tag":"span","props":{"class":"icon icon-link"}}]},"Transcript"]},"\n",{"tag":"p","children":["Let's say you have to build a website. It can be a blog, a documentation\nwebsite, or whatever you want. If you want a low cost solution that is\nperformant for your users, you might want to use a static website generator. The\ncurrent solutions are very limited."]},"\n",{"tag":"p","children":["Let’s say you could use your favourite stack. The one you love. The one that is\neasy to reason about. The one that allows you to improve the quality of your\ncode with unit testing and type checking. The one that can be used universally,\nin node, in a browser, even on a native app. Let’s say you can build your\nwebsite with React, webpack, Flow, CSS modules, and literally anything from npm."]},"\n",{"tag":"p","children":["Some solutions, like metalsmith can offer a fraction of that, but they just\nrender a dumb string."]},"\n",{"tag":"p","children":["In these cases, React doesn’t kick in on the client, so your ",{"tag":"code","children":["onClick"]}," events\nare ignored …"]},"\n",{"tag":"p","children":["With a bit of courage, you might hack your way into it, still you won’t have a\nproper asset graph."]},"\n",{"tag":"p","children":["I tried to hack my way into it"]},"\n",{"tag":"p","children":["I ended up creating a athoner kind of generator."]},"\n",{"tag":"p","children":["It’s called Phenomic."]},"\n",{"tag":"p","children":["If you represent Phenomic simply, it’s basically a function that takes your\ncontent and transforms it through webpack and react and makes a website out of\nit."]},"\n",{"tag":"pre","children":[{"tag":"code","children":["phenomic = (content) =>\n  webpack(\n    <Layout>{ content }</Layout>\n  )\n"]}]},"\n",{"tag":"p","children":["Your content can be written in Markdown, LaTex, HTML, JSON…"]},"\n",{"tag":"p","children":["Basically any format."]},"\n",{"tag":"p","children":["Forget the old templating languages 😐."]},"\n",{"tag":"p","children":["You build your website with React components."]},"\n",{"tag":"p","children":["You might ask, what does Phenomic adds to the equation ?"]},"\n",{"tag":"p","children":["First off, hot reloading."]},"\n",{"tag":"p","children":["Next, top-notch UX. At build time, Phenomic render each page as a static HTML\nfile. The result is a website completely SEO friendly that will work for the two\npeople in the whole world who disabled JS."]},"\n",{"tag":"p","children":["The big difference when JS is on is that when the user navigates, it just loads\nthe minimal data-requirements. In fact, for each page, Phenomic also creates a\nsmall chunk of JS containing its data."]},"\n",{"tag":"p","children":["With this, you can finally offer real-smooth page transitions, without the hacky\n\"pjax\" solution."]},"\n",{"tag":"p","children":["Out of the box, if you deliver your website over HTTPs, you have a progressive\nweb app (Service Worker included)."]},"\n",{"tag":"p","children":["You can generate an RSS feed or a sitemap with just a plugin."]},"\n",{"tag":"p","children":["We’re currently working on making Phenomic able to consume anything with a\nminimal API."]},"\n",{"tag":"p","children":["You will be able to generate a static version of a Wordpress website."]},"\n",{"tag":"p","children":["Another thing we’re working on is built in search. This is really amazing on a\nstatic website. We’re going to make an index at build time, so you can add a\nstatic search without relying on an external service."]},"\n",{"tag":"p","children":["Phenomic is a static website generator that wants developers and writers to be\nhappy."]},"\n",{"tag":"p","children":["As it’s a project by and for developers, we’d be really happy to receive your\ninput and contributions."]},"\n",{"tag":"p","children":["Thank you!"]},"\n",{"tag":"p","children":["Do not hesitate to visit ",{"tag":"a","props":{"href":"https://phenomic.io"},"children":["https://phenomic.io"]}," for more\ninformation about the project."]}]}}